app/Http/Controllers/AdminCategoryController.php

    public function index()
    {
        //Manual
        if (auth()->guest() || auth()->user()->username !== 'indrapradesa') { // memakai OR

            abort(403);
        }

        // Gate
        // $this->authorize('admin');

        return view('dashboard.categories.index', [
            'categories' => Category::all()
        ]);
---
SELECT * FROM `categories`