app/Http/Controllers/DashboardPostController.php

SELECT * FROM `posts` WHERE `user_id` = 4
---
    public function index()
    {
        return view('dashboard.posts.index', [
            'posts' => Post::where('user_id', auth()->user()->id)->get()
        ]);

SELECT * FROM `categories`
---
    public function create()
    {
        return view('dashboard.posts.created', [
            'categories' => Category::all()
        ]);

SELECT * FROM `categories`
---
    public function edit(Post $post)
    {
        return view('dashboard.posts.edit', [
            'post' => $post,
            'categories' => Category::all()
        ]);

DELETE FROM `posts` WHERE `id` = 24
SELECT * FROM `posts` WHERE `id` in (24)
---
    public function destroy(Post $post)
    {
        if ($post->image) {
            Storage::delete($post->image);
        }

        Post::destroy($post->id);

        return redirect('/dashboard/posts')->with('success', 'Post has been deleted!');