app/Http/Controllers/PostController.php

    public function index()
    {

        //dd(request('search'));
        //$posts = Post::latest();

        $title = '';
        if (request('category')) {
            $category = Category::firstWhere('slug', request('category'));
            $title = ' In ' . $category->name;
        }
        if (request('author')) {
            $author = User::firstWhere('username', request('author'));
            $title = ' By ' . $author->name;
        }

        return view('post', [
            "title" => "All Post" . $title,
            "active" => 'post',
            // "post" => Post::all()
            "posts" => Post::latest()->filter(request(['search', 'category', 'author']))->paginate(6)->withQueryString() //withQueryString -> membawa query string sebelumnya
---
SELECT * FROM `categories` WHERE `categories`.`id` in (1, 2)
SELECT * FROM `posts` ORDER BY `created_at` DESC LIMIT 6 offset 0
SELECT count(*) as aggregate FROM `posts`